Repository: felixparey/FelixCV
Catalog: FelixCV/Localizable.xcstrings
Source language: en
Languages: de

source: **Duck Rescue**: 3D game for Apple Vision Pro with RealityKit and SwiftUI
de: **Duck Rescue**: 3D-Spiel für Apple Vision Pro mit RealityKit und SwiftUI

source: **English** • C1
de: **Englisch** • C1

source: **German** • Native
de: **Deutsch** • Muttersprache

source: **Italian** • B2
de: **Italienisch** • B2

source: **Sleepot**: uses on-device AI to extract problems from a message
de: **Sleepot**: nutzt On-Device-KI, um Probleme aus einer Nachricht zu extrahieren

source: Advanced Course in Informatics, showing strong foundation in technology
de: Fortgeschrittener Informatikkurs, der ein starkes technologisches Fundament zeigt

source: Contact & Links
de: Kontakt & Links

source: Contains self-trained Image Classification AI model trained through CreateML
de: Enthält ein selbst trainiertes KI-Modell zur Bilderkennung, erstellt mit CreateML

source: Created multiple apps based on real-world problems following extensive research and applying human centered design
de: Erstellte mehrere Apps basierend auf realen Problemen nach intensiver Recherche und Anwendung nutzerzentrierten Designs

source: Deep understanding of SwiftData, connection to an external Database (FileMaker) and usage of MapKit for Navigation and Location Tracking
de: Tiefes Verständnis von SwiftData, Anbindung an eine externe Datenbank (FileMaker) und Nutzung von MapKit für Navigation

source: Developer Tools
de: Entwicklungs-Tools

source: Done
de: Fertig

source: Education
de: Ausbildung

source: Export PDF
de: PDF exportieren

source: Gained Experience in working with external clients through meetings and a trip to India
de: Sammelte Erfahrung in der Zusammenarbeit mit externen Partnern durch Meetings und eine Reise nach Indien

source: I authorize the processing of personal data contained within my CV, according to GDPR (EU) 2016/679, Article 6.1(a)
de: Ich erlaube die Verarbeitung der in meinem Lebenslauf enthaltenen personenbezogenen Daten gemäß DSGVO (EU) 2016/679, Artikel 6.1(a)

source: I love creating applications for Apple platforms, which I learned for 2 years at the Apple Developer Academy in Naples, developing multiple apps and working with an NGO, helping over 10.000 children in underprivileged communities in Mumbai, India. I won Apple's Swift Student Challenge in 2025 with an app that uses Machine Learning to deliver a fun experience. My wish is to contribute my skills in Swift and SwiftUI to a team that shares the same passion to develop high-quality apps centered around the user experience. My goal is to create apps that are not only functional but also enjoyable to use, while continuously learning and growing as a developer.
de: Ich liebe es, Anwendungen für Apple-Plattformen zu entwickeln, was ich zwei Jahre lang an der Apple Developer Academy in Neapel gelernt habe. Dabei habe ich mehrere Apps entwickelt und mit einer NGO zusammengearbeitet, die über 10.000 Kindern in benachteiligten Gemeinden in Mumbai, Indien, hilft. Ich gewann 2025 die Swift Student Challenge von Apple mit einer App, die Machine Learning für ein unterhaltsames Erlebnis nutzt. Mein Wunsch ist es, meine Fähigkeiten in Swift und SwiftUI in ein Team einzubringen, das dieselbe Leidenschaft für qualitativ hochwertige, benutzerzentrierte Apps teilt. Mein Ziel ist es, Apps zu entwickeln, die nicht nur funktional, sondern auch angenehm zu bedienen sind – und dabei ständig zu lernen und mich als Entwickler weiterzuentwickeln.

source: iOS DEVELOPER
de: iOS-ENTWICKLER

source: Language
de: Sprache

source: Languages
de: Sprachen

source: Learned how to work in newly formed teams with people from all over the world
de: Gelernt, in neu gebildeten Teams mit Menschen aus aller Welt zu arbeiten

source: Other Projects
de: Andere Projekte

source: Practiced public speaking and presenting projects in front of an audience
de: Geübt, Projekte vor Publikum zu präsentieren und öffentlich zu sprechen

source: Project Management
de: Projektmanagement

source: Published on the App Store with users in 30 different countries
de: Im App Store veröffentlicht mit Nutzern in 30 verschiedenen Ländern

source: Recent Projects
de: Letzte Projekte

source: Scrum, Agile Methodologies, Jira, Confluence
de: Scrum, agile Methoden, Jira, Confluence

source: Settings
de: Einstellungen

source: Skills
de: Fähigkeiten

source: Telephone
de: Telefon

source: This CV was written entirely in SwiftUI and the source code is available on GitHub.
de: Dieser Lebenslauf wurde vollständig in SwiftUI geschrieben und der Quellcode ist auf GitHub verfügbar.

source: Uncluttered design with a focus on usability and simplicity
de: Übersichtliches Design mit Fokus auf Benutzerfreundlichkeit und Einfachheit

source: Usage of latest technologies like SwiftUI, UserDefaults and StoreKit 2
de: Verwendung modernster Technologien wie SwiftUI und StoreKit 2

source: Usage of PencilKit, RealityKit, SwiftUI, CoreML
de: Verwendung von PencilKit, RealityKit, SwiftUI und CoreML

source: Used design tools like Figma and Sketch and gained experience in Swift Frameworks like RealityKit, CoreML, MapKit and SwiftData
de: Verwendete Design-Tools wie Figma und Sketch und sammelte Erfahrung mit Swift-Frameworks wie RealityKit, CoreML, MapKit und SwiftData

source: Winning project of the 2025 Swift Student Challenge
de: Gewinnerprojekt der Swift Student Challenge 2025

source: Worked in an Agile Team in sprints using Scrum with tools like Jira and Confluence
de: Arbeitete in einem agilen Team in Sprints mit Scrum und Tools wie Jira und Confluence

source: Worked on an iPad app, that was deployed and actively being used, for an NGO in India: The Akanksha Foundation
de: Arbeitete an einer iPad-App für eine NGO in Indien – The Akanksha Foundation –, die bereitgestellt und aktiv genutzt wird
